# discord

TOKEN = 'TOKEN' # сюда свой токен 

 # Все айдишники ниже уникальны для каждого свои

channel_id = {
    'Повышение' : 1135255056111915009,
    'Приказы' : 942433708168872037,
    'Выговоры' : 1138146442612052070
}

roles_id = {
    'Солдат': 1135271524530659489,
    'Рядовой': 1135265089453301810, # 2
    'Ефрейтор': 1135265360808001556, # 3
    'Младший сержант': 1135265447164514314, # 4
    'Сержант': 1135265552152150036, # 5
    'Старший сержант': 1135265662474928281, # 6
    'Прапорщик': 1135265893954359388, # 7
    'Старший прапорщик': 1135266031233941504, # 8
    'Лейтенант': 1135266312919208006, # 9
    'Старший лейтенант': 1135266399569318051, # 10
    'Капитан': 1135266529995390976, # 11
    'Майор': 1135291208093139024, # 12
    'Подполковник': 1135266690054242484, # 13
    'Полковник': 1135266746090127390, # 14
    'Генерал майор': 1135266831347748984, # 15
    'Генерал лейтенант': 1135266932464046142, # 16
    'Генерал полковник': 1135267963444936704 # 17
}
roles_id_of = {
    'низший офицерский состав': 1138148832140591134,
    'офицерский состав': 1136758725374382100,
    'высший офицерский состав': 1138148421723750440,
}

max_roles_index = 16 # рофлс


# mysql моя локал бд

host = "127.0.0.1"
user = "rootsql"
password = "rootsql"
db_name = "bdcvk"